In [1]:
# Import Dependencies
import pandas as pd
import numpy as np

In [2]:
# File to Load
purchase_data_path = "Resources/purchase_data.csv"

In [3]:
# Read the modified GoodReads csv and store into Pandas DataFrame
purchases_df = pd.read_csv(purchase_data_path, encoding="utf-8")
purchases_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [4]:
################
# Player count #
################

# Total unique players
unique_players_df = pd.DataFrame(purchases_df["SN"].unique())
total_players = unique_players_df.count()
total_players

0    576
dtype: int64

In [5]:
###############################
# Purchasing Analysis (Total) #
###############################

# Number of unique items
unique_items_df = pd.DataFrame(purchases_df["Item Name"].unique())
num_unique_items = unique_items_df.count()
num_unique_items

0    179
dtype: int64

In [6]:
# Average purchase price
average_purchase_price = purchases_df["Price"].mean()
average_purchase_price = round(average_purchase_price, 2)
average_purchase_price

3.05

In [7]:
# Total number of purchases
total_purchases = purchases_df["Purchase ID"].count()
total_purchases

780

In [8]:
# Total revenue
total_revenue = purchases_df["Price"].sum()
"${:,.2f}".format(float(total_revenue))

'$2,379.77'

In [9]:
#######################
# Gender Demographics #
#######################

# Get unique player data frame
unique_players_df = purchases_df.drop_duplicates(['SN'], keep='last')

# In order to be visualized, a data function must be used...
unique_players_df.count().head(10)

Purchase ID    576
SN             576
Age            576
Gender         576
Item ID        576
Item Name      576
Price          576
dtype: int64

In [10]:
# Gender counts
male_df = unique_players_df.loc[unique_players_df["Gender"] == "Male"]
male_count = male_df["Gender"].count()

female_df = unique_players_df.loc[unique_players_df["Gender"] == "Female"]
female_count = female_df["Gender"].count()

other_df = unique_players_df.loc[unique_players_df["Gender"] == "Other / Non-Disclosed"]
other_count = other_df["Gender"].count()

total_players = unique_players_df["Gender"].count()

print(f"Male Count: {male_count} ({round((male_count/total_players)*100,2)}%)")
print(f"Female Count: {female_count} ({round((female_count/total_players)*100,2)}%)")
print(f"Other Count: {other_count} ({round((other_count/total_players)*100,2)}%)")

Male Count: 484 (84.03%)
Female Count: 81 (14.06%)
Other Count: 11 (1.91%)

In [11]:
################################
# Purchasing Analysis (Gender) #
################################

# Purchase Count by Gender
purchases_df["Gender"].value_counts()

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [12]:
# Average Purchase Price by Gender
male_purchases_df = purchases_df.loc[purchases_df["Gender"] == "Male"]
average_male_purchase_price = male_purchases_df["Price"].mean()
average_male_purchase_price = "${:.2f}".format(float(round(average_male_purchase_price,2)))

female_purchases_df = purchases_df.loc[purchases_df["Gender"] == "Female"]
average_female_purchase_price = female_purchases_df["Price"].mean()
average_female_purchase_price = "${:.2f}".format(float(round(average_female_purchase_price,2)))

other_purchases_df = purchases_df.loc[purchases_df["Gender"] == "Other / Non-Disclosed"]
average_other_purchase_price = other_purchases_df["Price"].mean()
average_other_purchase_price = "${:.2f}".format(float(round(average_other_purchase_price,2)))

# Creating a summary DataFrame using above values
summary_df = pd.DataFrame({"Average Male Purchase Price": [average_male_purchase_price],
                          "Average Female Purchase Price": [average_female_purchase_price],
                          "Average Other Purchase Price": [average_other_purchase_price]})
summary_df

,Average Male Purchase Price,Average Female Purchase Price,Average Other Purchase Price
0,$3.02,$3.20,$3.35

In [13]:
# Total Purchase Value
male_purchases_df = purchases_df.loc[purchases_df["Gender"] == "Male"]
total_male_purchases = male_purchases_df["Price"].sum()
total_male_purchases = "${:,.2f}".format(float(round(total_male_purchases,2)))

female_purchases_df = purchases_df.loc[purchases_df["Gender"] == "Female"]
total_female_purchases = female_purchases_df["Price"].sum()
total_female_purchases = "${:.2f}".format(float(round(total_female_purchases,2)))

other_purchases_df = purchases_df.loc[purchases_df["Gender"] == "Other / Non-Disclosed"]
total_other_purchases = other_purchases_df["Price"].sum()
total_other_purchases = "${:.2f}".format(float(round(total_other_purchases,2)))

# Creating a summary DataFrame using above values
summary_df = pd.DataFrame({"Total Male Purchases": [total_male_purchases],
                          "Total Female Purchases": [total_female_purchases],
                          "Total Other Purchases": [total_other_purchases]})
summary_df

  Total Male Purchases Total Female Purchases Total Other Purchases
0            $1,967.64                $361.94                $50.19

In [16]:
# Average Purchase Total per Person by Gender
grouped_users_df = purchases_df.rename(columns={"SN": "User"})
grouped_users_df = grouped_users_df.groupby(["User","Gender"])

average_totals = grouped_users_df["Price"].mean()

average_totals.head(15)

User          Gender
Adairialis76  Male      2.280000
Adastirin33   Female    4.480000
Aeda94        Male      4.910000
Aela59        Male      4.320000
Aelaria33     Male      1.790000
Aelastirin39  Male      3.645000
Aelidru27     Male      1.090000
Aelin32       Male      2.993333
Aelly27       Male      3.395000
Aellynun67    Male      3.740000
Aellyria80    Male      3.080000
Aelollo59     Male      2.815000
Aenarap34     Male      2.960000
Aeral43       Male      4.400000
Aeral68       Male      4.000000
Name: Price, dtype: float64

In [17]:
####################
# Age Demographics #
####################

# Purchase Count by Age Group

# Create the bins in which Data will be held
bins = [0, 10, 14, 19, 24, 29, 34, 39, 44, 49]

# Create the names for the five bins
group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40-44", "45-49"]

age_group_df = purchases_df

age_group_df["Age Group"] = pd.cut(purchases_df["Age"], bins, labels=group_names, include_lowest=True)

age_group_df = age_group_df.groupby(["Age Group"])

In [18]:
# Purchase Count by Age Group
purchase_count_by_age = age_group_df["Purchase ID"].count()
purchase_count_by_age

Age Group
<10       32
10-14     19
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40-44     12
45-49      1
Name: Purchase ID, dtype: int64

In [19]:
# Average Purchase Price by Age Group
average_purchase_price_by_age = age_group_df["Price"].mean()
average_purchase_price_by_age

Age Group
<10      3.405000
10-14    2.681579
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40-44    3.045000
45-49    1.700000
Name: Price, dtype: float64

In [20]:
# Total Purchase Value by Age Group
total_purchase_value_by_age = age_group_df["Price"].sum()
total_purchase_value_by_age

Age Group
<10       108.96
10-14      50.95
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40-44      36.54
45-49       1.70
Name: Price, dtype: float64

In [21]:
# Average Purchase Total per Person by Age Group
age_group_df = purchases_df
age_group_df["Age Group"] = pd.cut(purchases_df["Age"], bins, labels=group_names, include_lowest=True)
average_purchase_df = age_group_df.groupby("SN")['Price'].mean()

# Merge the age group with average purchase total
merge_df = pd.merge(age_group_df, average_purchase_df, on="SN")

# Delete extraneous column
del merge_df['Purchase ID']
del merge_df['Age']
del merge_df['Gender']
del merge_df['Item ID']
del merge_df['Item Name']
del merge_df['Price_x']

average_purchase_total_df = merge_df.rename(columns={"SN":"User", "Price_y":"Average Purchase Total"})

cleaned_average_purchase_total_df = average_purchase_total_df.drop_duplicates(['User'], keep='last')
grouped_average_user_total_purchase = cleaned_average_purchase_total_df.groupby(["Age Group"])

grouped_average_user_total_purchase["Average Purchase Total"].sum()

Age Group
<10       84.491667
10-14     41.770000
15-19    328.838333
20-24    782.452500
25-29    218.120333
30-34    152.951667
35-39    110.253333
40-44     33.945000
45-49      1.700000
Name: Average Purchase Total, dtype: float64

In [22]:
################
# Top Spenders #
################

# Total Purchase Value
total_purchase_value_df = purchases_df.groupby(['SN'])['Price'] \
                             .sum() \
                             .reset_index(name='Total Purchase Value') \
                             .sort_values(['Total Purchase Value'], ascending=False) \
                             .head(5)

total_purchase_value_df = total_purchase_value_df.reset_index(drop=True)
total_purchase_value_df

            SN  Total Purchase Value
0    Lisosia93                 18.96
1  Idastidru52                 15.45
2   Chamjask73                 13.83
3       Iral74                 13.62
4  Iskadarya95                 13.10

In [23]:
# Purchase Count
purchase_count_df = purchases_df.groupby(['SN'])['Purchase ID'] \
                             .count() \
                             .reset_index(name='Purchase Count') \
                             .sort_values(['Purchase Count'], ascending=False)

merge_1_df = pd.merge(total_purchase_value_df, purchase_count_df, on="SN")
merge_1_df

            SN  Total Purchase Value  Purchase Count
0    Lisosia93                 18.96               5
1  Idastidru52                 15.45               4
2   Chamjask73                 13.83               3
3       Iral74                 13.62               4
4  Iskadarya95                 13.10               3

In [24]:
# Average Purchase Price
avarage_purchase_price_df = purchases_df.groupby(['SN'])['Price'] \
                             .mean() \
                             .reset_index(name='Average Purchase Price') \
                             .sort_values(['Average Purchase Price'], ascending=False)

merge_2_df = pd.merge(merge_1_df, avarage_purchase_price_df, on="SN")
merge_2_df

            SN  Total Purchase Value  Purchase Count  Average Purchase Price
0    Lisosia93                 18.96               5                3.792000
1  Idastidru52                 15.45               4                3.862500
2   Chamjask73                 13.83               3                4.610000
3       Iral74                 13.62               4                3.405000
4  Iskadarya95                 13.10               3                4.366667

In [25]:
# Top 5 Spenders by total purchase value
top_5_spenders_df = merge_2_df[["SN","Purchase Count","Average Purchase Price","Total Purchase Value"]]
top_5_spenders_df

            SN  Purchase Count  Average Purchase Price  Total Purchase Value
0    Lisosia93               5                3.792000                 18.96
1  Idastidru52               4                3.862500                 15.45
2   Chamjask73               3                4.610000                 13.83
3       Iral74               4                3.405000                 13.62
4  Iskadarya95               3                4.366667                 13.10

In [26]:
######################
# Most Popular Items #
######################

# 5 most popular items by purchase count
purchase_count_df = purchases_df.groupby(['Item ID','Item Name'])['Purchase ID'] \
                             .count() \
                             .reset_index(name='Purchase Count') \
                             .sort_values(['Purchase Count'], ascending=False) \
                             .head(5)

purchase_count_df = purchase_count_df.reset_index(drop=True)
purchase_count_df

   Item ID                                     Item Name  Purchase Count
0       92                                  Final Critic              13
1      178  Oathbreaker, Last Hope of the Breaking Storm              12
2      145                          Fiery Glass Crusader               9
3      132                                    Persuasion               9
4      108     Extraction, Quickblade Of Trembling Hands               9

In [27]:
# Merge Items Price into Purchase Count
item_price_df = purchases_df[["Item ID","Price"]]
merge_1_df = pd.merge(purchase_count_df, item_price_df, on="Item ID")
#merge_1_df

In [28]:
# Merge Total Purchase Value
total_purchase_value_df = purchases_df.groupby(['Item ID'])['Price'] \
                             .sum() \
                             .reset_index(name='Total Purchase Value') \
                             .sort_values(['Total Purchase Value'], ascending=False)
merge_2_df = pd.merge(merge_1_df, total_purchase_value_df, on="Item ID")

# Let's ignore the Price differences for Item ID 92 and 132

In [29]:
# 5 most popular items by purchase count
poplular_items_by_purchase_count = merge_2_df.drop_duplicates(['Item ID'], keep='last')
poplular_items_by_purchase_count = poplular_items_by_purchase_count.reset_index(drop=True)
poplular_items_by_purchase_count

,Item ID,Item Name,Purchase Count,Price,Total Purchase Value
0,92,Final Critic,13,4.19,59.99
1,178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
2,145,Fiery Glass Crusader,9,4.58,41.22
3,132,Persuasion,9,3.33,28.99
4,108,"Extraction, Quickblade Of Trembling Hands",9,3.53,31.77

In [30]:
#########################
# Most Profitable Items #
#########################

# 5 most popular items by purchase value
purchase_value_df = purchases_df.groupby(['Item ID','Item Name'])['Price'] \
                             .sum() \
                             .reset_index(name='Total Purchase Value') \
                             .sort_values(['Total Purchase Value'], ascending=False) \
                             .head(5)

purchase_value_df = purchase_value_df.reset_index(drop=True)
purchase_value_df

   Item ID                                     Item Name  Total Purchase Value
0       92                                  Final Critic                 59.99
1      178  Oathbreaker, Last Hope of the Breaking Storm                 50.76
2       82                                       Nirvana                 44.10
3      145                          Fiery Glass Crusader                 41.22
4      103                                Singed Scalpel                 34.80

In [31]:
# Merge purchase count
purchase_count_df = purchases_df.groupby(['Item ID'])['Purchase ID'] \
                             .count() \
                             .reset_index(name='Purchase Count') \
                             .sort_values(['Purchase Count'], ascending=False)
merge_1_df = pd.merge(purchase_value_df, purchase_count_df, on="Item ID")

In [32]:
# Merge Item Price
item_price_df = purchases_df[["Item ID","Price"]]
merge_2_df = pd.merge(merge_1_df, item_price_df, on="Item ID")

In [33]:
# 5 most profitable items by total purchase value
poplular_items_by_total_purchase_value = merge_2_df.drop_duplicates(['Item ID'], keep='last')
poplular_items_by_total_purchase_value = poplular_items_by_total_purchase_value[["Item ID","Item Name","Purchase Count","Price","Total Purchase Value"]]
poplular_items_by_total_purchase_value = poplular_items_by_total_purchase_value.reset_index(drop=True)
poplular_items_by_total_purchase_value

,Item ID,Item Name,Purchase Count,Price,Total Purchase Value
0,92,Final Critic,13,4.19,59.99
1,178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
2,82,Nirvana,9,4.90,44.10
3,145,Fiery Glass Crusader,9,4.58,41.22
4,103,Singed Scalpel,8,4.35,34.80

In [ ]:
# Three Observable Trends

# 1. Between the ages of 20 to 24 spent the most on items
# 2. Heroes Of Pymoli is most popular with males between the ages of 20 to 24
# 3. The 'Final Critic' is the most popular and most profictable item